


&НаКлиенте
Процедура ТестироватьЗадачу(Команда)
	Тесты.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ЗапуститьТестированиеНаСервере", ЭтотОбъект ))	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьТестированиеНаСервере(ВыбранныйЭлемент, ДополнительныеПараметры) экспорт
	ТестироватьЗадачуНаСервере(ВыбранныйЭлемент.Значение);
КонецПроцедуры


&НаСервере
Процедура ТестироватьЗадачуНаСервере(Задача)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Тесты.Вставить(0, "Задача_1", "Простые до Н", , );
КонецПроцедуры

