#Область Интерфейс

&НаКлиенте
Процедура ТестироватьЗадачу(Команда)
	Тесты.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ЗапуститьТестированиеНаСервере", ЭтотОбъект ));	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьТестированиеНаСервере(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	ТестироватьЗадачуНаСервере(ВыбранныйЭлемент.Значение);
КонецПроцедуры


#КонецОбласти

&НаСервере
Процедура ТестироватьЗадачуНаСервере(Задача)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Тесты.Вставить(0, "Задача_1", "Простые до Н", , );
КонецПроцедуры

