#Область Интерфейс
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Тесты.Вставить(0, "Задача_1", "Простые до Н");
КонецПроцедуры

&НаКлиенте
Процедура ТестироватьЗадачу(Команда)
	Тесты.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ЗапуститьТестированиеНаСервере", ЭтотОбъект ));	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьТестированиеНаСервере(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	ТестироватьЗадачуНаСервере(ВыбранныйЭлемент.Значение);
КонецПроцедуры
#КонецОбласти

#Область РешенияЗадач
&НаСервере
Процедура ТестироватьЗадачуНаСервере(Задача)
	Если Задача = "Задача_1" Тогда
		НачальноеВремя = ТекущаяДатаСеанса();
		КонечноеВремя = ТекущаяДатаСеанса();
		Сообщить (""+КонечноеВремя - НачальноеВремя);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти